grevaillot/svd_tools/headers/ATSAM4SP32A/pioa.h
#pragma once 

/* --- PIOA: Parallel Input/Output Controller A --------------------- */

/** @defgroup pioa_registers Parallel Input/Output Controller A Register
@{*/

/** PIOA_PER PIO Enable Register **/
#define PIOA_PER			MMIO32(PIOA_BASE + 0x00)
/** PIOA_PDR PIO Disable Register **/
#define PIOA_PDR			MMIO32(PIOA_BASE + 0x04)
/** PIOA_PSR PIO Status Register **/
#define PIOA_PSR			MMIO32(PIOA_BASE + 0x08)
/** PIOA_OER Output Enable Register **/
#define PIOA_OER			MMIO32(PIOA_BASE + 0x10)
/** PIOA_ODR Output Disable Register **/
#define PIOA_ODR			MMIO32(PIOA_BASE + 0x14)
/** PIOA_OSR Output Status Register **/
#define PIOA_OSR			MMIO32(PIOA_BASE + 0x18)
/** PIOA_IFER Glitch Input Filter Enable Register **/
#define PIOA_IFER			MMIO32(PIOA_BASE + 0x20)
/** PIOA_IFDR Glitch Input Filter Disable Register **/
#define PIOA_IFDR			MMIO32(PIOA_BASE + 0x24)
/** PIOA_IFSR Glitch Input Filter Status Register **/
#define PIOA_IFSR			MMIO32(PIOA_BASE + 0x28)
/** PIOA_SODR Set Output Data Register **/
#define PIOA_SODR			MMIO32(PIOA_BASE + 0x30)
/** PIOA_CODR Clear Output Data Register **/
#define PIOA_CODR			MMIO32(PIOA_BASE + 0x34)
/** PIOA_ODSR Output Data Status Register **/
#define PIOA_ODSR			MMIO32(PIOA_BASE + 0x38)
/** PIOA_PDSR Pin Data Status Register **/
#define PIOA_PDSR			MMIO32(PIOA_BASE + 0x3c)
/** PIOA_IER Interrupt Enable Register **/
#define PIOA_IER			MMIO32(PIOA_BASE + 0x40)
/** PIOA_IDR Interrupt Disable Register **/
#define PIOA_IDR			MMIO32(PIOA_BASE + 0x44)
/** PIOA_IMR Interrupt Mask Register **/
#define PIOA_IMR			MMIO32(PIOA_BASE + 0x48)
/** PIOA_ISR Interrupt Status Register **/
#define PIOA_ISR			MMIO32(PIOA_BASE + 0x4c)
/** PIOA_MDER Multi-driver Enable Register **/
#define PIOA_MDER			MMIO32(PIOA_BASE + 0x50)
/** PIOA_MDDR Multi-driver Disable Register **/
#define PIOA_MDDR			MMIO32(PIOA_BASE + 0x54)
/** PIOA_MDSR Multi-driver Status Register **/
#define PIOA_MDSR			MMIO32(PIOA_BASE + 0x58)
/** PIOA_PUDR Pull-up Disable Register **/
#define PIOA_PUDR			MMIO32(PIOA_BASE + 0x60)
/** PIOA_PUER Pull-up Enable Register **/
#define PIOA_PUER			MMIO32(PIOA_BASE + 0x64)
/** PIOA_PUSR Pad Pull-up Status Register **/
#define PIOA_PUSR			MMIO32(PIOA_BASE + 0x68)
/** PIOA_ABCDSR[0] Peripheral Select Register **/
#define PIOA_ABCDSR[0]			MMIO32(PIOA_BASE + 0x70)
/** PIOA_ABCDSR[1] Peripheral Select Register **/
#define PIOA_ABCDSR[1]			MMIO32(PIOA_BASE + 0x74)
/** PIOA_IFSCDR Input Filter Slow Clock Disable Register **/
#define PIOA_IFSCDR			MMIO32(PIOA_BASE + 0x80)
/** PIOA_IFSCER Input Filter Slow Clock Enable Register **/
#define PIOA_IFSCER			MMIO32(PIOA_BASE + 0x84)
/** PIOA_IFSCSR Input Filter Slow Clock Status Register **/
#define PIOA_IFSCSR			MMIO32(PIOA_BASE + 0x88)
/** PIOA_SCDR Slow Clock Divider Debouncing Register **/
#define PIOA_SCDR			MMIO32(PIOA_BASE + 0x8c)
/** PIOA_PPDDR Pad Pull-down Disable Register **/
#define PIOA_PPDDR			MMIO32(PIOA_BASE + 0x90)
/** PIOA_PPDER Pad Pull-down Enable Register **/
#define PIOA_PPDER			MMIO32(PIOA_BASE + 0x94)
/** PIOA_PPDSR Pad Pull-down Status Register **/
#define PIOA_PPDSR			MMIO32(PIOA_BASE + 0x98)
/** PIOA_OWER Output Write Enable **/
#define PIOA_OWER			MMIO32(PIOA_BASE + 0xa0)
/** PIOA_OWDR Output Write Disable **/
#define PIOA_OWDR			MMIO32(PIOA_BASE + 0xa4)
/** PIOA_OWSR Output Write Status Register **/
#define PIOA_OWSR			MMIO32(PIOA_BASE + 0xa8)
/** PIOA_AIMER Additional Interrupt Modes Enable Register **/
#define PIOA_AIMER			MMIO32(PIOA_BASE + 0xb0)
/** PIOA_AIMDR Additional Interrupt Modes Disables Register **/
#define PIOA_AIMDR			MMIO32(PIOA_BASE + 0xb4)
/** PIOA_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOA_AIMMR			MMIO32(PIOA_BASE + 0xb8)
/** PIOA_ESR Edge Select Register **/
#define PIOA_ESR			MMIO32(PIOA_BASE + 0xc0)
/** PIOA_LSR Level Select Register **/
#define PIOA_LSR			MMIO32(PIOA_BASE + 0xc4)
/** PIOA_ELSR Edge/Level Status Register **/
#define PIOA_ELSR			MMIO32(PIOA_BASE + 0xc8)
/** PIOA_FELLSR Falling Edge/Low Level Select Register **/
#define PIOA_FELLSR			MMIO32(PIOA_BASE + 0xd0)
/** PIOA_REHLSR Rising Edge/ High Level Select Register **/
#define PIOA_REHLSR			MMIO32(PIOA_BASE + 0xd4)
/** PIOA_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOA_FRLHSR			MMIO32(PIOA_BASE + 0xd8)
/** PIOA_LOCKSR Lock Status **/
#define PIOA_LOCKSR			MMIO32(PIOA_BASE + 0xe0)
/** PIOA_WPMR Write Protect Mode Register **/
#define PIOA_WPMR			MMIO32(PIOA_BASE + 0xe4)
/** PIOA_WPSR Write Protect Status Register **/
#define PIOA_WPSR			MMIO32(PIOA_BASE + 0xe8)
/** PIOA_SCHMITT Schmitt Trigger Register **/
#define PIOA_SCHMITT			MMIO32(PIOA_BASE + 0x100)
/** PIOA_PCMR Parallel Capture Mode Register **/
#define PIOA_PCMR			MMIO32(PIOA_BASE + 0x150)
/** PIOA_PCIER Parallel Capture Interrupt Enable Register **/
#define PIOA_PCIER			MMIO32(PIOA_BASE + 0x154)
/** PIOA_PCIDR Parallel Capture Interrupt Disable Register **/
#define PIOA_PCIDR			MMIO32(PIOA_BASE + 0x158)
/** PIOA_PCIMR Parallel Capture Interrupt Mask Register **/
#define PIOA_PCIMR			MMIO32(PIOA_BASE + 0x15c)
/** PIOA_PCISR Parallel Capture Interrupt Status Register **/
#define PIOA_PCISR			MMIO32(PIOA_BASE + 0x160)
/** PIOA_PCRHR Parallel Capture Reception Holding Register **/
#define PIOA_PCRHR			MMIO32(PIOA_BASE + 0x164)
/** PIOA_RPR Receive Pointer Register **/
#define PIOA_RPR			MMIO32(PIOA_BASE + 0x168)
/** PIOA_RCR Receive Counter Register **/
#define PIOA_RCR			MMIO32(PIOA_BASE + 0x16c)
/** PIOA_RNPR Receive Next Pointer Register **/
#define PIOA_RNPR			MMIO32(PIOA_BASE + 0x178)
/** PIOA_RNCR Receive Next Counter Register **/
#define PIOA_RNCR			MMIO32(PIOA_BASE + 0x17c)
/** PIOA_PTCR Transfer Control Register **/
#define PIOA_PTCR			MMIO32(PIOA_BASE + 0x188)
/** PIOA_PTSR Transfer Status Register **/
#define PIOA_PTSR			MMIO32(PIOA_BASE + 0x18c)

/**@}*/


/** @defgroup pioa_per PER PIO Enable Register
@{*/

/** PIOA_PER_P31 PIO Enable **/
#define PIOA_PER_P31		(1 << 31)
/** PIOA_PER_P30 PIO Enable **/
#define PIOA_PER_P30		(1 << 30)
/** PIOA_PER_P29 PIO Enable **/
#define PIOA_PER_P29		(1 << 29)
/** PIOA_PER_P28 PIO Enable **/
#define PIOA_PER_P28		(1 << 28)
/** PIOA_PER_P27 PIO Enable **/
#define PIOA_PER_P27		(1 << 27)
/** PIOA_PER_P26 PIO Enable **/
#define PIOA_PER_P26		(1 << 26)
/** PIOA_PER_P25 PIO Enable **/
#define PIOA_PER_P25		(1 << 25)
/** PIOA_PER_P24 PIO Enable **/
#define PIOA_PER_P24		(1 << 24)
/** PIOA_PER_P23 PIO Enable **/
#define PIOA_PER_P23		(1 << 23)
/** PIOA_PER_P22 PIO Enable **/
#define PIOA_PER_P22		(1 << 22)
/** PIOA_PER_P21 PIO Enable **/
#define PIOA_PER_P21		(1 << 21)
/** PIOA_PER_P20 PIO Enable **/
#define PIOA_PER_P20		(1 << 20)
/** PIOA_PER_P19 PIO Enable **/
#define PIOA_PER_P19		(1 << 19)
/** PIOA_PER_P18 PIO Enable **/
#define PIOA_PER_P18		(1 << 18)
/** PIOA_PER_P17 PIO Enable **/
#define PIOA_PER_P17		(1 << 17)
/** PIOA_PER_P16 PIO Enable **/
#define PIOA_PER_P16		(1 << 16)
/** PIOA_PER_P15 PIO Enable **/
#define PIOA_PER_P15		(1 << 15)
/** PIOA_PER_P14 PIO Enable **/
#define PIOA_PER_P14		(1 << 14)
/** PIOA_PER_P13 PIO Enable **/
#define PIOA_PER_P13		(1 << 13)
/** PIOA_PER_P12 PIO Enable **/
#define PIOA_PER_P12		(1 << 12)
/** PIOA_PER_P11 PIO Enable **/
#define PIOA_PER_P11		(1 << 11)
/** PIOA_PER_P10 PIO Enable **/
#define PIOA_PER_P10		(1 << 10)
/** PIOA_PER_P9 PIO Enable **/
#define PIOA_PER_P9		(1 << 9)
/** PIOA_PER_P8 PIO Enable **/
#define PIOA_PER_P8		(1 << 8)
/** PIOA_PER_P7 PIO Enable **/
#define PIOA_PER_P7		(1 << 7)
/** PIOA_PER_P6 PIO Enable **/
#define PIOA_PER_P6		(1 << 6)
/** PIOA_PER_P5 PIO Enable **/
#define PIOA_PER_P5		(1 << 5)
/** PIOA_PER_P4 PIO Enable **/
#define PIOA_PER_P4		(1 << 4)
/** PIOA_PER_P3 PIO Enable **/
#define PIOA_PER_P3		(1 << 3)
/** PIOA_PER_P2 PIO Enable **/
#define PIOA_PER_P2		(1 << 2)
/** PIOA_PER_P1 PIO Enable **/
#define PIOA_PER_P1		(1 << 1)
/** PIOA_PER_P0 PIO Enable **/
#define PIOA_PER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pdr PDR PIO Disable Register
@{*/

