grevaillot/svd_tools/headers/ATSAM4SP32A/pioa.h
/** @defgroup pioa_pdsr PDSR Pin Data Status Register
@{*/

/** PIOA_PDSR_P31 Output Data Status **/
#define PIOA_PDSR_P31		(1 << 31)
/** PIOA_PDSR_P30 Output Data Status **/
#define PIOA_PDSR_P30		(1 << 30)
/** PIOA_PDSR_P29 Output Data Status **/
#define PIOA_PDSR_P29		(1 << 29)
/** PIOA_PDSR_P28 Output Data Status **/
#define PIOA_PDSR_P28		(1 << 28)
/** PIOA_PDSR_P27 Output Data Status **/
#define PIOA_PDSR_P27		(1 << 27)
/** PIOA_PDSR_P26 Output Data Status **/
#define PIOA_PDSR_P26		(1 << 26)
/** PIOA_PDSR_P25 Output Data Status **/
#define PIOA_PDSR_P25		(1 << 25)
/** PIOA_PDSR_P24 Output Data Status **/
#define PIOA_PDSR_P24		(1 << 24)
/** PIOA_PDSR_P23 Output Data Status **/
#define PIOA_PDSR_P23		(1 << 23)
/** PIOA_PDSR_P22 Output Data Status **/
#define PIOA_PDSR_P22		(1 << 22)
/** PIOA_PDSR_P21 Output Data Status **/
#define PIOA_PDSR_P21		(1 << 21)
/** PIOA_PDSR_P20 Output Data Status **/
#define PIOA_PDSR_P20		(1 << 20)
/** PIOA_PDSR_P19 Output Data Status **/
#define PIOA_PDSR_P19		(1 << 19)
/** PIOA_PDSR_P18 Output Data Status **/
#define PIOA_PDSR_P18		(1 << 18)
/** PIOA_PDSR_P17 Output Data Status **/
#define PIOA_PDSR_P17		(1 << 17)
/** PIOA_PDSR_P16 Output Data Status **/
#define PIOA_PDSR_P16		(1 << 16)
/** PIOA_PDSR_P15 Output Data Status **/
#define PIOA_PDSR_P15		(1 << 15)
/** PIOA_PDSR_P14 Output Data Status **/
#define PIOA_PDSR_P14		(1 << 14)
/** PIOA_PDSR_P13 Output Data Status **/
#define PIOA_PDSR_P13		(1 << 13)
/** PIOA_PDSR_P12 Output Data Status **/
#define PIOA_PDSR_P12		(1 << 12)
/** PIOA_PDSR_P11 Output Data Status **/
#define PIOA_PDSR_P11		(1 << 11)
/** PIOA_PDSR_P10 Output Data Status **/
#define PIOA_PDSR_P10		(1 << 10)
/** PIOA_PDSR_P9 Output Data Status **/
#define PIOA_PDSR_P9		(1 << 9)
/** PIOA_PDSR_P8 Output Data Status **/
#define PIOA_PDSR_P8		(1 << 8)
/** PIOA_PDSR_P7 Output Data Status **/
#define PIOA_PDSR_P7		(1 << 7)
/** PIOA_PDSR_P6 Output Data Status **/
#define PIOA_PDSR_P6		(1 << 6)
/** PIOA_PDSR_P5 Output Data Status **/
#define PIOA_PDSR_P5		(1 << 5)
/** PIOA_PDSR_P4 Output Data Status **/
#define PIOA_PDSR_P4		(1 << 4)
/** PIOA_PDSR_P3 Output Data Status **/
#define PIOA_PDSR_P3		(1 << 3)
/** PIOA_PDSR_P2 Output Data Status **/
#define PIOA_PDSR_P2		(1 << 2)
/** PIOA_PDSR_P1 Output Data Status **/
#define PIOA_PDSR_P1		(1 << 1)
/** PIOA_PDSR_P0 Output Data Status **/
#define PIOA_PDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_ier IER Interrupt Enable Register
@{*/

/** PIOA_IER_P31 Input Change Interrupt Enable **/
#define PIOA_IER_P31		(1 << 31)
/** PIOA_IER_P30 Input Change Interrupt Enable **/
#define PIOA_IER_P30		(1 << 30)
/** PIOA_IER_P29 Input Change Interrupt Enable **/
#define PIOA_IER_P29		(1 << 29)
/** PIOA_IER_P28 Input Change Interrupt Enable **/
#define PIOA_IER_P28		(1 << 28)
/** PIOA_IER_P27 Input Change Interrupt Enable **/
#define PIOA_IER_P27		(1 << 27)
/** PIOA_IER_P26 Input Change Interrupt Enable **/
#define PIOA_IER_P26		(1 << 26)
/** PIOA_IER_P25 Input Change Interrupt Enable **/
#define PIOA_IER_P25		(1 << 25)
/** PIOA_IER_P24 Input Change Interrupt Enable **/
#define PIOA_IER_P24		(1 << 24)
/** PIOA_IER_P23 Input Change Interrupt Enable **/
#define PIOA_IER_P23		(1 << 23)
/** PIOA_IER_P22 Input Change Interrupt Enable **/
#define PIOA_IER_P22		(1 << 22)
/** PIOA_IER_P21 Input Change Interrupt Enable **/
#define PIOA_IER_P21		(1 << 21)
/** PIOA_IER_P20 Input Change Interrupt Enable **/
#define PIOA_IER_P20		(1 << 20)
/** PIOA_IER_P19 Input Change Interrupt Enable **/
#define PIOA_IER_P19		(1 << 19)
/** PIOA_IER_P18 Input Change Interrupt Enable **/
#define PIOA_IER_P18		(1 << 18)
/** PIOA_IER_P17 Input Change Interrupt Enable **/
#define PIOA_IER_P17		(1 << 17)
/** PIOA_IER_P16 Input Change Interrupt Enable **/
#define PIOA_IER_P16		(1 << 16)
/** PIOA_IER_P15 Input Change Interrupt Enable **/
#define PIOA_IER_P15		(1 << 15)
/** PIOA_IER_P14 Input Change Interrupt Enable **/
#define PIOA_IER_P14		(1 << 14)
/** PIOA_IER_P13 Input Change Interrupt Enable **/
#define PIOA_IER_P13		(1 << 13)
/** PIOA_IER_P12 Input Change Interrupt Enable **/
#define PIOA_IER_P12		(1 << 12)
/** PIOA_IER_P11 Input Change Interrupt Enable **/
#define PIOA_IER_P11		(1 << 11)
/** PIOA_IER_P10 Input Change Interrupt Enable **/
#define PIOA_IER_P10		(1 << 10)
/** PIOA_IER_P9 Input Change Interrupt Enable **/
#define PIOA_IER_P9		(1 << 9)
/** PIOA_IER_P8 Input Change Interrupt Enable **/
#define PIOA_IER_P8		(1 << 8)
/** PIOA_IER_P7 Input Change Interrupt Enable **/
#define PIOA_IER_P7		(1 << 7)
/** PIOA_IER_P6 Input Change Interrupt Enable **/
#define PIOA_IER_P6		(1 << 6)
/** PIOA_IER_P5 Input Change Interrupt Enable **/
#define PIOA_IER_P5		(1 << 5)
/** PIOA_IER_P4 Input Change Interrupt Enable **/
#define PIOA_IER_P4		(1 << 4)
/** PIOA_IER_P3 Input Change Interrupt Enable **/
#define PIOA_IER_P3		(1 << 3)
/** PIOA_IER_P2 Input Change Interrupt Enable **/
#define PIOA_IER_P2		(1 << 2)
/** PIOA_IER_P1 Input Change Interrupt Enable **/
#define PIOA_IER_P1		(1 << 1)
/** PIOA_IER_P0 Input Change Interrupt Enable **/
#define PIOA_IER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_idr IDR Interrupt Disable Register
@{*/

/** PIOA_IDR_P31 Input Change Interrupt Disable **/
#define PIOA_IDR_P31		(1 << 31)
/** PIOA_IDR_P30 Input Change Interrupt Disable **/
#define PIOA_IDR_P30		(1 << 30)
/** PIOA_IDR_P29 Input Change Interrupt Disable **/
#define PIOA_IDR_P29		(1 << 29)
/** PIOA_IDR_P28 Input Change Interrupt Disable **/
#define PIOA_IDR_P28		(1 << 28)
/** PIOA_IDR_P27 Input Change Interrupt Disable **/
#define PIOA_IDR_P27		(1 << 27)
/** PIOA_IDR_P26 Input Change Interrupt Disable **/
#define PIOA_IDR_P26		(1 << 26)
/** PIOA_IDR_P25 Input Change Interrupt Disable **/
#define PIOA_IDR_P25		(1 << 25)
/** PIOA_IDR_P24 Input Change Interrupt Disable **/
#define PIOA_IDR_P24		(1 << 24)
/** PIOA_IDR_P23 Input Change Interrupt Disable **/
#define PIOA_IDR_P23		(1 << 23)
/** PIOA_IDR_P22 Input Change Interrupt Disable **/
#define PIOA_IDR_P22		(1 << 22)
/** PIOA_IDR_P21 Input Change Interrupt Disable **/
#define PIOA_IDR_P21		(1 << 21)
/** PIOA_IDR_P20 Input Change Interrupt Disable **/
#define PIOA_IDR_P20		(1 << 20)
/** PIOA_IDR_P19 Input Change Interrupt Disable **/
#define PIOA_IDR_P19		(1 << 19)
/** PIOA_IDR_P18 Input Change Interrupt Disable **/
#define PIOA_IDR_P18		(1 << 18)
/** PIOA_IDR_P17 Input Change Interrupt Disable **/
#define PIOA_IDR_P17		(1 << 17)
/** PIOA_IDR_P16 Input Change Interrupt Disable **/
#define PIOA_IDR_P16		(1 << 16)
/** PIOA_IDR_P15 Input Change Interrupt Disable **/
#define PIOA_IDR_P15		(1 << 15)
/** PIOA_IDR_P14 Input Change Interrupt Disable **/
#define PIOA_IDR_P14		(1 << 14)
/** PIOA_IDR_P13 Input Change Interrupt Disable **/
#define PIOA_IDR_P13		(1 << 13)
/** PIOA_IDR_P12 Input Change Interrupt Disable **/
#define PIOA_IDR_P12		(1 << 12)
/** PIOA_IDR_P11 Input Change Interrupt Disable **/
#define PIOA_IDR_P11		(1 << 11)
/** PIOA_IDR_P10 Input Change Interrupt Disable **/
#define PIOA_IDR_P10		(1 << 10)
/** PIOA_IDR_P9 Input Change Interrupt Disable **/
#define PIOA_IDR_P9		(1 << 9)
/** PIOA_IDR_P8 Input Change Interrupt Disable **/
#define PIOA_IDR_P8		(1 << 8)
/** PIOA_IDR_P7 Input Change Interrupt Disable **/
#define PIOA_IDR_P7		(1 << 7)
/** PIOA_IDR_P6 Input Change Interrupt Disable **/
#define PIOA_IDR_P6		(1 << 6)
/** PIOA_IDR_P5 Input Change Interrupt Disable **/
#define PIOA_IDR_P5		(1 << 5)
/** PIOA_IDR_P4 Input Change Interrupt Disable **/
#define PIOA_IDR_P4		(1 << 4)
/** PIOA_IDR_P3 Input Change Interrupt Disable **/
#define PIOA_IDR_P3		(1 << 3)
/** PIOA_IDR_P2 Input Change Interrupt Disable **/
#define PIOA_IDR_P2		(1 << 2)
/** PIOA_IDR_P1 Input Change Interrupt Disable **/
#define PIOA_IDR_P1		(1 << 1)
/** PIOA_IDR_P0 Input Change Interrupt Disable **/
#define PIOA_IDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_imr IMR Interrupt Mask Register
@{*/

/** PIOA_IMR_P31 Input Change Interrupt Mask **/
#define PIOA_IMR_P31		(1 << 31)
/** PIOA_IMR_P30 Input Change Interrupt Mask **/
#define PIOA_IMR_P30		(1 << 30)
/** PIOA_IMR_P29 Input Change Interrupt Mask **/
#define PIOA_IMR_P29		(1 << 29)
/** PIOA_IMR_P28 Input Change Interrupt Mask **/
#define PIOA_IMR_P28		(1 << 28)
/** PIOA_IMR_P27 Input Change Interrupt Mask **/
#define PIOA_IMR_P27		(1 << 27)
/** PIOA_IMR_P26 Input Change Interrupt Mask **/
#define PIOA_IMR_P26		(1 << 26)
/** PIOA_IMR_P25 Input Change Interrupt Mask **/
#define PIOA_IMR_P25		(1 << 25)
/** PIOA_IMR_P24 Input Change Interrupt Mask **/
#define PIOA_IMR_P24		(1 << 24)
/** PIOA_IMR_P23 Input Change Interrupt Mask **/
#define PIOA_IMR_P23		(1 << 23)
/** PIOA_IMR_P22 Input Change Interrupt Mask **/
#define PIOA_IMR_P22		(1 << 22)
/** PIOA_IMR_P21 Input Change Interrupt Mask **/
#define PIOA_IMR_P21		(1 << 21)
/** PIOA_IMR_P20 Input Change Interrupt Mask **/
#define PIOA_IMR_P20		(1 << 20)
/** PIOA_IMR_P19 Input Change Interrupt Mask **/
#define PIOA_IMR_P19		(1 << 19)
/** PIOA_IMR_P18 Input Change Interrupt Mask **/
#define PIOA_IMR_P18		(1 << 18)
/** PIOA_IMR_P17 Input Change Interrupt Mask **/
#define PIOA_IMR_P17		(1 << 17)
/** PIOA_IMR_P16 Input Change Interrupt Mask **/
#define PIOA_IMR_P16		(1 << 16)
/** PIOA_IMR_P15 Input Change Interrupt Mask **/
#define PIOA_IMR_P15		(1 << 15)
/** PIOA_IMR_P14 Input Change Interrupt Mask **/
#define PIOA_IMR_P14		(1 << 14)
/** PIOA_IMR_P13 Input Change Interrupt Mask **/
#define PIOA_IMR_P13		(1 << 13)
/** PIOA_IMR_P12 Input Change Interrupt Mask **/
#define PIOA_IMR_P12		(1 << 12)
/** PIOA_IMR_P11 Input Change Interrupt Mask **/
#define PIOA_IMR_P11		(1 << 11)
/** PIOA_IMR_P10 Input Change Interrupt Mask **/
#define PIOA_IMR_P10		(1 << 10)
/** PIOA_IMR_P9 Input Change Interrupt Mask **/
#define PIOA_IMR_P9		(1 << 9)
/** PIOA_IMR_P8 Input Change Interrupt Mask **/
#define PIOA_IMR_P8		(1 << 8)
/** PIOA_IMR_P7 Input Change Interrupt Mask **/
#define PIOA_IMR_P7		(1 << 7)
/** PIOA_IMR_P6 Input Change Interrupt Mask **/
#define PIOA_IMR_P6		(1 << 6)
/** PIOA_IMR_P5 Input Change Interrupt Mask **/
#define PIOA_IMR_P5		(1 << 5)
/** PIOA_IMR_P4 Input Change Interrupt Mask **/
#define PIOA_IMR_P4		(1 << 4)
/** PIOA_IMR_P3 Input Change Interrupt Mask **/
#define PIOA_IMR_P3		(1 << 3)
/** PIOA_IMR_P2 Input Change Interrupt Mask **/
#define PIOA_IMR_P2		(1 << 2)
/** PIOA_IMR_P1 Input Change Interrupt Mask **/
#define PIOA_IMR_P1		(1 << 1)
/** PIOA_IMR_P0 Input Change Interrupt Mask **/
#define PIOA_IMR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_isr ISR Interrupt Status Register
@{*/

/** PIOA_ISR_P31 Input Change Interrupt Status **/
#define PIOA_ISR_P31		(1 << 31)
/** PIOA_ISR_P30 Input Change Interrupt Status **/
#define PIOA_ISR_P30		(1 << 30)
/** PIOA_ISR_P29 Input Change Interrupt Status **/
#define PIOA_ISR_P29		(1 << 29)
/** PIOA_ISR_P28 Input Change Interrupt Status **/
#define PIOA_ISR_P28		(1 << 28)
/** PIOA_ISR_P27 Input Change Interrupt Status **/
#define PIOA_ISR_P27		(1 << 27)
/** PIOA_ISR_P26 Input Change Interrupt Status **/
#define PIOA_ISR_P26		(1 << 26)
/** PIOA_ISR_P25 Input Change Interrupt Status **/
#define PIOA_ISR_P25		(1 << 25)
/** PIOA_ISR_P24 Input Change Interrupt Status **/
#define PIOA_ISR_P24		(1 << 24)
/** PIOA_ISR_P23 Input Change Interrupt Status **/
#define PIOA_ISR_P23		(1 << 23)
/** PIOA_ISR_P22 Input Change Interrupt Status **/
#define PIOA_ISR_P22		(1 << 22)
/** PIOA_ISR_P21 Input Change Interrupt Status **/
#define PIOA_ISR_P21		(1 << 21)
/** PIOA_ISR_P20 Input Change Interrupt Status **/
#define PIOA_ISR_P20		(1 << 20)
/** PIOA_ISR_P19 Input Change Interrupt Status **/
#define PIOA_ISR_P19		(1 << 19)
/** PIOA_ISR_P18 Input Change Interrupt Status **/
#define PIOA_ISR_P18		(1 << 18)
/** PIOA_ISR_P17 Input Change Interrupt Status **/
#define PIOA_ISR_P17		(1 << 17)
/** PIOA_ISR_P16 Input Change Interrupt Status **/
#define PIOA_ISR_P16		(1 << 16)
/** PIOA_ISR_P15 Input Change Interrupt Status **/
#define PIOA_ISR_P15		(1 << 15)
/** PIOA_ISR_P14 Input Change Interrupt Status **/
#define PIOA_ISR_P14		(1 << 14)
/** PIOA_ISR_P13 Input Change Interrupt Status **/
#define PIOA_ISR_P13		(1 << 13)
/** PIOA_ISR_P12 Input Change Interrupt Status **/
#define PIOA_ISR_P12		(1 << 12)
/** PIOA_ISR_P11 Input Change Interrupt Status **/
#define PIOA_ISR_P11		(1 << 11)
/** PIOA_ISR_P10 Input Change Interrupt Status **/
#define PIOA_ISR_P10		(1 << 10)
/** PIOA_ISR_P9 Input Change Interrupt Status **/
#define PIOA_ISR_P9		(1 << 9)
/** PIOA_ISR_P8 Input Change Interrupt Status **/
#define PIOA_ISR_P8		(1 << 8)
/** PIOA_ISR_P7 Input Change Interrupt Status **/
#define PIOA_ISR_P7		(1 << 7)
/** PIOA_ISR_P6 Input Change Interrupt Status **/
#define PIOA_ISR_P6		(1 << 6)
/** PIOA_ISR_P5 Input Change Interrupt Status **/
#define PIOA_ISR_P5		(1 << 5)
/** PIOA_ISR_P4 Input Change Interrupt Status **/
#define PIOA_ISR_P4		(1 << 4)
/** PIOA_ISR_P3 Input Change Interrupt Status **/
#define PIOA_ISR_P3		(1 << 3)
/** PIOA_ISR_P2 Input Change Interrupt Status **/
#define PIOA_ISR_P2		(1 << 2)
/** PIOA_ISR_P1 Input Change Interrupt Status **/
#define PIOA_ISR_P1		(1 << 1)
/** PIOA_ISR_P0 Input Change Interrupt Status **/
#define PIOA_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_mder MDER Multi-driver Enable Register
@{*/

