grevaillot/svd_tools/headers/ATSAM4SP32A/pioa.h
/** @defgroup pioa_owdr OWDR Output Write Disable
@{*/

/** PIOA_OWDR_P31 Output Write Disable. **/
#define PIOA_OWDR_P31		(1 << 31)
/** PIOA_OWDR_P30 Output Write Disable. **/
#define PIOA_OWDR_P30		(1 << 30)
/** PIOA_OWDR_P29 Output Write Disable. **/
#define PIOA_OWDR_P29		(1 << 29)
/** PIOA_OWDR_P28 Output Write Disable. **/
#define PIOA_OWDR_P28		(1 << 28)
/** PIOA_OWDR_P27 Output Write Disable. **/
#define PIOA_OWDR_P27		(1 << 27)
/** PIOA_OWDR_P26 Output Write Disable. **/
#define PIOA_OWDR_P26		(1 << 26)
/** PIOA_OWDR_P25 Output Write Disable. **/
#define PIOA_OWDR_P25		(1 << 25)
/** PIOA_OWDR_P24 Output Write Disable. **/
#define PIOA_OWDR_P24		(1 << 24)
/** PIOA_OWDR_P23 Output Write Disable. **/
#define PIOA_OWDR_P23		(1 << 23)
/** PIOA_OWDR_P22 Output Write Disable. **/
#define PIOA_OWDR_P22		(1 << 22)
/** PIOA_OWDR_P21 Output Write Disable. **/
#define PIOA_OWDR_P21		(1 << 21)
/** PIOA_OWDR_P20 Output Write Disable. **/
#define PIOA_OWDR_P20		(1 << 20)
/** PIOA_OWDR_P19 Output Write Disable. **/
#define PIOA_OWDR_P19		(1 << 19)
/** PIOA_OWDR_P18 Output Write Disable. **/
#define PIOA_OWDR_P18		(1 << 18)
/** PIOA_OWDR_P17 Output Write Disable. **/
#define PIOA_OWDR_P17		(1 << 17)
/** PIOA_OWDR_P16 Output Write Disable. **/
#define PIOA_OWDR_P16		(1 << 16)
/** PIOA_OWDR_P15 Output Write Disable. **/
#define PIOA_OWDR_P15		(1 << 15)
/** PIOA_OWDR_P14 Output Write Disable. **/
#define PIOA_OWDR_P14		(1 << 14)
/** PIOA_OWDR_P13 Output Write Disable. **/
#define PIOA_OWDR_P13		(1 << 13)
/** PIOA_OWDR_P12 Output Write Disable. **/
#define PIOA_OWDR_P12		(1 << 12)
/** PIOA_OWDR_P11 Output Write Disable. **/
#define PIOA_OWDR_P11		(1 << 11)
/** PIOA_OWDR_P10 Output Write Disable. **/
#define PIOA_OWDR_P10		(1 << 10)
/** PIOA_OWDR_P9 Output Write Disable. **/
#define PIOA_OWDR_P9		(1 << 9)
/** PIOA_OWDR_P8 Output Write Disable. **/
#define PIOA_OWDR_P8		(1 << 8)
/** PIOA_OWDR_P7 Output Write Disable. **/
#define PIOA_OWDR_P7		(1 << 7)
/** PIOA_OWDR_P6 Output Write Disable. **/
#define PIOA_OWDR_P6		(1 << 6)
/** PIOA_OWDR_P5 Output Write Disable. **/
#define PIOA_OWDR_P5		(1 << 5)
/** PIOA_OWDR_P4 Output Write Disable. **/
#define PIOA_OWDR_P4		(1 << 4)
/** PIOA_OWDR_P3 Output Write Disable. **/
#define PIOA_OWDR_P3		(1 << 3)
/** PIOA_OWDR_P2 Output Write Disable. **/
#define PIOA_OWDR_P2		(1 << 2)
/** PIOA_OWDR_P1 Output Write Disable. **/
#define PIOA_OWDR_P1		(1 << 1)
/** PIOA_OWDR_P0 Output Write Disable. **/
#define PIOA_OWDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_owsr OWSR Output Write Status Register
@{*/

/** PIOA_OWSR_P31 Output Write Status. **/
#define PIOA_OWSR_P31		(1 << 31)
/** PIOA_OWSR_P30 Output Write Status. **/
#define PIOA_OWSR_P30		(1 << 30)
/** PIOA_OWSR_P29 Output Write Status. **/
#define PIOA_OWSR_P29		(1 << 29)
/** PIOA_OWSR_P28 Output Write Status. **/
#define PIOA_OWSR_P28		(1 << 28)
/** PIOA_OWSR_P27 Output Write Status. **/
#define PIOA_OWSR_P27		(1 << 27)
/** PIOA_OWSR_P26 Output Write Status. **/
#define PIOA_OWSR_P26		(1 << 26)
/** PIOA_OWSR_P25 Output Write Status. **/
#define PIOA_OWSR_P25		(1 << 25)
/** PIOA_OWSR_P24 Output Write Status. **/
#define PIOA_OWSR_P24		(1 << 24)
/** PIOA_OWSR_P23 Output Write Status. **/
#define PIOA_OWSR_P23		(1 << 23)
/** PIOA_OWSR_P22 Output Write Status. **/
#define PIOA_OWSR_P22		(1 << 22)
/** PIOA_OWSR_P21 Output Write Status. **/
#define PIOA_OWSR_P21		(1 << 21)
/** PIOA_OWSR_P20 Output Write Status. **/
#define PIOA_OWSR_P20		(1 << 20)
/** PIOA_OWSR_P19 Output Write Status. **/
#define PIOA_OWSR_P19		(1 << 19)
/** PIOA_OWSR_P18 Output Write Status. **/
#define PIOA_OWSR_P18		(1 << 18)
/** PIOA_OWSR_P17 Output Write Status. **/
#define PIOA_OWSR_P17		(1 << 17)
/** PIOA_OWSR_P16 Output Write Status. **/
#define PIOA_OWSR_P16		(1 << 16)
/** PIOA_OWSR_P15 Output Write Status. **/
#define PIOA_OWSR_P15		(1 << 15)
/** PIOA_OWSR_P14 Output Write Status. **/
#define PIOA_OWSR_P14		(1 << 14)
/** PIOA_OWSR_P13 Output Write Status. **/
#define PIOA_OWSR_P13		(1 << 13)
/** PIOA_OWSR_P12 Output Write Status. **/
#define PIOA_OWSR_P12		(1 << 12)
/** PIOA_OWSR_P11 Output Write Status. **/
#define PIOA_OWSR_P11		(1 << 11)
/** PIOA_OWSR_P10 Output Write Status. **/
#define PIOA_OWSR_P10		(1 << 10)
/** PIOA_OWSR_P9 Output Write Status. **/
#define PIOA_OWSR_P9		(1 << 9)
/** PIOA_OWSR_P8 Output Write Status. **/
#define PIOA_OWSR_P8		(1 << 8)
/** PIOA_OWSR_P7 Output Write Status. **/
#define PIOA_OWSR_P7		(1 << 7)
/** PIOA_OWSR_P6 Output Write Status. **/
#define PIOA_OWSR_P6		(1 << 6)
/** PIOA_OWSR_P5 Output Write Status. **/
#define PIOA_OWSR_P5		(1 << 5)
/** PIOA_OWSR_P4 Output Write Status. **/
#define PIOA_OWSR_P4		(1 << 4)
/** PIOA_OWSR_P3 Output Write Status. **/
#define PIOA_OWSR_P3		(1 << 3)
/** PIOA_OWSR_P2 Output Write Status. **/
#define PIOA_OWSR_P2		(1 << 2)
/** PIOA_OWSR_P1 Output Write Status. **/
#define PIOA_OWSR_P1		(1 << 1)
/** PIOA_OWSR_P0 Output Write Status. **/
#define PIOA_OWSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_aimer AIMER Additional Interrupt Modes Enable Register
@{*/

/** PIOA_AIMER_P31 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P31		(1 << 31)
/** PIOA_AIMER_P30 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P30		(1 << 30)
/** PIOA_AIMER_P29 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P29		(1 << 29)
/** PIOA_AIMER_P28 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P28		(1 << 28)
/** PIOA_AIMER_P27 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P27		(1 << 27)
/** PIOA_AIMER_P26 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P26		(1 << 26)
/** PIOA_AIMER_P25 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P25		(1 << 25)
/** PIOA_AIMER_P24 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P24		(1 << 24)
/** PIOA_AIMER_P23 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P23		(1 << 23)
/** PIOA_AIMER_P22 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P22		(1 << 22)
/** PIOA_AIMER_P21 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P21		(1 << 21)
/** PIOA_AIMER_P20 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P20		(1 << 20)
/** PIOA_AIMER_P19 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P19		(1 << 19)
/** PIOA_AIMER_P18 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P18		(1 << 18)
/** PIOA_AIMER_P17 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P17		(1 << 17)
/** PIOA_AIMER_P16 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P16		(1 << 16)
/** PIOA_AIMER_P15 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P15		(1 << 15)
/** PIOA_AIMER_P14 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P14		(1 << 14)
/** PIOA_AIMER_P13 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P13		(1 << 13)
/** PIOA_AIMER_P12 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P12		(1 << 12)
/** PIOA_AIMER_P11 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P11		(1 << 11)
/** PIOA_AIMER_P10 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P10		(1 << 10)
/** PIOA_AIMER_P9 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P9		(1 << 9)
/** PIOA_AIMER_P8 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P8		(1 << 8)
/** PIOA_AIMER_P7 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P7		(1 << 7)
/** PIOA_AIMER_P6 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P6		(1 << 6)
/** PIOA_AIMER_P5 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P5		(1 << 5)
/** PIOA_AIMER_P4 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P4		(1 << 4)
/** PIOA_AIMER_P3 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P3		(1 << 3)
/** PIOA_AIMER_P2 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P2		(1 << 2)
/** PIOA_AIMER_P1 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P1		(1 << 1)
/** PIOA_AIMER_P0 Additional Interrupt Modes Enable. **/
#define PIOA_AIMER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_aimdr AIMDR Additional Interrupt Modes Disables Register
@{*/

