grevaillot/svd_tools/headers/ATSAM4SP32A/pioa.h
/** PIOA_AIMDR_P31 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P31		(1 << 31)
/** PIOA_AIMDR_P30 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P30		(1 << 30)
/** PIOA_AIMDR_P29 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P29		(1 << 29)
/** PIOA_AIMDR_P28 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P28		(1 << 28)
/** PIOA_AIMDR_P27 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P27		(1 << 27)
/** PIOA_AIMDR_P26 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P26		(1 << 26)
/** PIOA_AIMDR_P25 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P25		(1 << 25)
/** PIOA_AIMDR_P24 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P24		(1 << 24)
/** PIOA_AIMDR_P23 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P23		(1 << 23)
/** PIOA_AIMDR_P22 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P22		(1 << 22)
/** PIOA_AIMDR_P21 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P21		(1 << 21)
/** PIOA_AIMDR_P20 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P20		(1 << 20)
/** PIOA_AIMDR_P19 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P19		(1 << 19)
/** PIOA_AIMDR_P18 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P18		(1 << 18)
/** PIOA_AIMDR_P17 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P17		(1 << 17)
/** PIOA_AIMDR_P16 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P16		(1 << 16)
/** PIOA_AIMDR_P15 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P15		(1 << 15)
/** PIOA_AIMDR_P14 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P14		(1 << 14)
/** PIOA_AIMDR_P13 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P13		(1 << 13)
/** PIOA_AIMDR_P12 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P12		(1 << 12)
/** PIOA_AIMDR_P11 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P11		(1 << 11)
/** PIOA_AIMDR_P10 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P10		(1 << 10)
/** PIOA_AIMDR_P9 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P9		(1 << 9)
/** PIOA_AIMDR_P8 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P8		(1 << 8)
/** PIOA_AIMDR_P7 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P7		(1 << 7)
/** PIOA_AIMDR_P6 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P6		(1 << 6)
/** PIOA_AIMDR_P5 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P5		(1 << 5)
/** PIOA_AIMDR_P4 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P4		(1 << 4)
/** PIOA_AIMDR_P3 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P3		(1 << 3)
/** PIOA_AIMDR_P2 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P2		(1 << 2)
/** PIOA_AIMDR_P1 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P1		(1 << 1)
/** PIOA_AIMDR_P0 Additional Interrupt Modes Disable. **/
#define PIOA_AIMDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_aimmr AIMMR Additional Interrupt Modes Mask Register
@{*/

/** PIOA_AIMMR_P31 Peripheral CD Status. **/
#define PIOA_AIMMR_P31		(1 << 31)
/** PIOA_AIMMR_P30 Peripheral CD Status. **/
#define PIOA_AIMMR_P30		(1 << 30)
/** PIOA_AIMMR_P29 Peripheral CD Status. **/
#define PIOA_AIMMR_P29		(1 << 29)
/** PIOA_AIMMR_P28 Peripheral CD Status. **/
#define PIOA_AIMMR_P28		(1 << 28)
/** PIOA_AIMMR_P27 Peripheral CD Status. **/
#define PIOA_AIMMR_P27		(1 << 27)
/** PIOA_AIMMR_P26 Peripheral CD Status. **/
#define PIOA_AIMMR_P26		(1 << 26)
/** PIOA_AIMMR_P25 Peripheral CD Status. **/
#define PIOA_AIMMR_P25		(1 << 25)
/** PIOA_AIMMR_P24 Peripheral CD Status. **/
#define PIOA_AIMMR_P24		(1 << 24)
/** PIOA_AIMMR_P23 Peripheral CD Status. **/
#define PIOA_AIMMR_P23		(1 << 23)
/** PIOA_AIMMR_P22 Peripheral CD Status. **/
#define PIOA_AIMMR_P22		(1 << 22)
/** PIOA_AIMMR_P21 Peripheral CD Status. **/
#define PIOA_AIMMR_P21		(1 << 21)
/** PIOA_AIMMR_P20 Peripheral CD Status. **/
#define PIOA_AIMMR_P20		(1 << 20)
/** PIOA_AIMMR_P19 Peripheral CD Status. **/
#define PIOA_AIMMR_P19		(1 << 19)
/** PIOA_AIMMR_P18 Peripheral CD Status. **/
#define PIOA_AIMMR_P18		(1 << 18)
/** PIOA_AIMMR_P17 Peripheral CD Status. **/
#define PIOA_AIMMR_P17		(1 << 17)
/** PIOA_AIMMR_P16 Peripheral CD Status. **/
#define PIOA_AIMMR_P16		(1 << 16)
/** PIOA_AIMMR_P15 Peripheral CD Status. **/
#define PIOA_AIMMR_P15		(1 << 15)
/** PIOA_AIMMR_P14 Peripheral CD Status. **/
#define PIOA_AIMMR_P14		(1 << 14)
/** PIOA_AIMMR_P13 Peripheral CD Status. **/
#define PIOA_AIMMR_P13		(1 << 13)
/** PIOA_AIMMR_P12 Peripheral CD Status. **/
#define PIOA_AIMMR_P12		(1 << 12)
/** PIOA_AIMMR_P11 Peripheral CD Status. **/
#define PIOA_AIMMR_P11		(1 << 11)
/** PIOA_AIMMR_P10 Peripheral CD Status. **/
#define PIOA_AIMMR_P10		(1 << 10)
/** PIOA_AIMMR_P9 Peripheral CD Status. **/
#define PIOA_AIMMR_P9		(1 << 9)
/** PIOA_AIMMR_P8 Peripheral CD Status. **/
#define PIOA_AIMMR_P8		(1 << 8)
/** PIOA_AIMMR_P7 Peripheral CD Status. **/
#define PIOA_AIMMR_P7		(1 << 7)
/** PIOA_AIMMR_P6 Peripheral CD Status. **/
#define PIOA_AIMMR_P6		(1 << 6)
/** PIOA_AIMMR_P5 Peripheral CD Status. **/
#define PIOA_AIMMR_P5		(1 << 5)
/** PIOA_AIMMR_P4 Peripheral CD Status. **/
#define PIOA_AIMMR_P4		(1 << 4)
/** PIOA_AIMMR_P3 Peripheral CD Status. **/
#define PIOA_AIMMR_P3		(1 << 3)
/** PIOA_AIMMR_P2 Peripheral CD Status. **/
#define PIOA_AIMMR_P2		(1 << 2)
/** PIOA_AIMMR_P1 Peripheral CD Status. **/
#define PIOA_AIMMR_P1		(1 << 1)
/** PIOA_AIMMR_P0 Peripheral CD Status. **/
#define PIOA_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_esr ESR Edge Select Register
@{*/

/** PIOA_ESR_P31 Edge Interrupt Selection. **/
#define PIOA_ESR_P31		(1 << 31)
/** PIOA_ESR_P30 Edge Interrupt Selection. **/
#define PIOA_ESR_P30		(1 << 30)
/** PIOA_ESR_P29 Edge Interrupt Selection. **/
#define PIOA_ESR_P29		(1 << 29)
/** PIOA_ESR_P28 Edge Interrupt Selection. **/
#define PIOA_ESR_P28		(1 << 28)
/** PIOA_ESR_P27 Edge Interrupt Selection. **/
#define PIOA_ESR_P27		(1 << 27)
/** PIOA_ESR_P26 Edge Interrupt Selection. **/
#define PIOA_ESR_P26		(1 << 26)
/** PIOA_ESR_P25 Edge Interrupt Selection. **/
#define PIOA_ESR_P25		(1 << 25)
/** PIOA_ESR_P24 Edge Interrupt Selection. **/
#define PIOA_ESR_P24		(1 << 24)
/** PIOA_ESR_P23 Edge Interrupt Selection. **/
#define PIOA_ESR_P23		(1 << 23)
/** PIOA_ESR_P22 Edge Interrupt Selection. **/
#define PIOA_ESR_P22		(1 << 22)
/** PIOA_ESR_P21 Edge Interrupt Selection. **/
#define PIOA_ESR_P21		(1 << 21)
/** PIOA_ESR_P20 Edge Interrupt Selection. **/
#define PIOA_ESR_P20		(1 << 20)
/** PIOA_ESR_P19 Edge Interrupt Selection. **/
#define PIOA_ESR_P19		(1 << 19)
/** PIOA_ESR_P18 Edge Interrupt Selection. **/
#define PIOA_ESR_P18		(1 << 18)
/** PIOA_ESR_P17 Edge Interrupt Selection. **/
#define PIOA_ESR_P17		(1 << 17)
/** PIOA_ESR_P16 Edge Interrupt Selection. **/
#define PIOA_ESR_P16		(1 << 16)
/** PIOA_ESR_P15 Edge Interrupt Selection. **/
#define PIOA_ESR_P15		(1 << 15)
/** PIOA_ESR_P14 Edge Interrupt Selection. **/
#define PIOA_ESR_P14		(1 << 14)
/** PIOA_ESR_P13 Edge Interrupt Selection. **/
#define PIOA_ESR_P13		(1 << 13)
/** PIOA_ESR_P12 Edge Interrupt Selection. **/
#define PIOA_ESR_P12		(1 << 12)
/** PIOA_ESR_P11 Edge Interrupt Selection. **/
#define PIOA_ESR_P11		(1 << 11)
/** PIOA_ESR_P10 Edge Interrupt Selection. **/
#define PIOA_ESR_P10		(1 << 10)
/** PIOA_ESR_P9 Edge Interrupt Selection. **/
#define PIOA_ESR_P9		(1 << 9)
/** PIOA_ESR_P8 Edge Interrupt Selection. **/
#define PIOA_ESR_P8		(1 << 8)
/** PIOA_ESR_P7 Edge Interrupt Selection. **/
#define PIOA_ESR_P7		(1 << 7)
/** PIOA_ESR_P6 Edge Interrupt Selection. **/
#define PIOA_ESR_P6		(1 << 6)
/** PIOA_ESR_P5 Edge Interrupt Selection. **/
#define PIOA_ESR_P5		(1 << 5)
/** PIOA_ESR_P4 Edge Interrupt Selection. **/
#define PIOA_ESR_P4		(1 << 4)
/** PIOA_ESR_P3 Edge Interrupt Selection. **/
#define PIOA_ESR_P3		(1 << 3)
/** PIOA_ESR_P2 Edge Interrupt Selection. **/
#define PIOA_ESR_P2		(1 << 2)
/** PIOA_ESR_P1 Edge Interrupt Selection. **/
#define PIOA_ESR_P1		(1 << 1)
/** PIOA_ESR_P0 Edge Interrupt Selection. **/
#define PIOA_ESR_P0		(1 << 0)

/**@}*/

