grevaillot/svd_tools/headers/ATSAM4SP32A/pioa.h
/** PIOA_PCIER_RXBUFF Reception Buffer Full Interrupt Enable **/
#define PIOA_PCIER_RXBUFF		(1 << 3)
/** PIOA_PCIER_ENDRX End of Reception Transfer Interrupt Enable **/
#define PIOA_PCIER_ENDRX		(1 << 2)
/** PIOA_PCIER_OVRE Parallel Capture Mode Overrun Error Interrupt Enable **/
#define PIOA_PCIER_OVRE		(1 << 1)
/** PIOA_PCIER_DRDY Parallel Capture Mode Data Ready Interrupt Enable **/
#define PIOA_PCIER_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioa_pcidr PCIDR Parallel Capture Interrupt Disable Register
@{*/

/** PIOA_PCIDR_RXBUFF Reception Buffer Full Interrupt Disable **/
#define PIOA_PCIDR_RXBUFF		(1 << 3)
/** PIOA_PCIDR_ENDRX End of Reception Transfer Interrupt Disable **/
#define PIOA_PCIDR_ENDRX		(1 << 2)
/** PIOA_PCIDR_OVRE Parallel Capture Mode Overrun Error Interrupt Disable **/
#define PIOA_PCIDR_OVRE		(1 << 1)
/** PIOA_PCIDR_DRDY Parallel Capture Mode Data Ready Interrupt Disable **/
#define PIOA_PCIDR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioa_pcimr PCIMR Parallel Capture Interrupt Mask Register
@{*/

/** PIOA_PCIMR_RXBUFF Reception Buffer Full Interrupt Mask **/
#define PIOA_PCIMR_RXBUFF		(1 << 3)
/** PIOA_PCIMR_ENDRX End of Reception Transfer Interrupt Mask **/
#define PIOA_PCIMR_ENDRX		(1 << 2)
/** PIOA_PCIMR_OVRE Parallel Capture Mode Overrun Error Interrupt Mask **/
#define PIOA_PCIMR_OVRE		(1 << 1)
/** PIOA_PCIMR_DRDY Parallel Capture Mode Data Ready Interrupt Mask **/
#define PIOA_PCIMR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioa_pcisr PCISR Parallel Capture Interrupt Status Register
@{*/

/** PIOA_PCISR_RXBUFF Reception Buffer Full **/
#define PIOA_PCISR_RXBUFF		(1 << 3)
/** PIOA_PCISR_ENDRX End of Reception Transfer. **/
#define PIOA_PCISR_ENDRX		(1 << 2)
/** PIOA_PCISR_OVRE Parallel Capture Mode Overrun Error. **/
#define PIOA_PCISR_OVRE		(1 << 1)
/** PIOA_PCISR_DRDY Parallel Capture Mode Data Ready **/
#define PIOA_PCISR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioa_pcrhr PCRHR Parallel Capture Reception Holding Register
@{*/


#define PIOA_PCRHR_RDATA_SHIFT		0
#define PIOA_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup pioa_pcrhr_rdata RDATA Parallel Capture Mode Reception Data.
@{*/
/**@}*/


/**@}*/

/** @defgroup pioa_rpr RPR Receive Pointer Register
@{*/


#define PIOA_RPR_RXPTR_SHIFT		0
#define PIOA_RPR_RXPTR_MASK		0xffffffff
/** @defgroup pioa_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pioa_rcr RCR Receive Counter Register
@{*/


#define PIOA_RCR_RXCTR_SHIFT		0
#define PIOA_RCR_RXCTR_MASK		0xffff
/** @defgroup pioa_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pioa_rnpr RNPR Receive Next Pointer Register
@{*/


#define PIOA_RNPR_RXNPTR_SHIFT		0
#define PIOA_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup pioa_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup pioa_rncr RNCR Receive Next Counter Register
@{*/


#define PIOA_RNCR_RXNCTR_SHIFT		0
#define PIOA_RNCR_RXNCTR_MASK		0xffff
/** @defgroup pioa_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup pioa_ptcr PTCR Transfer Control Register
@{*/

/** PIOA_PTCR_TXTDIS Transmitter Transfer Disable **/
#define PIOA_PTCR_TXTDIS		(1 << 9)
/** PIOA_PTCR_TXTEN Transmitter Transfer Enable **/
#define PIOA_PTCR_TXTEN		(1 << 8)
/** PIOA_PTCR_RXTDIS Receiver Transfer Disable **/
#define PIOA_PTCR_RXTDIS		(1 << 1)
/** PIOA_PTCR_RXTEN Receiver Transfer Enable **/
#define PIOA_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup pioa_ptsr PTSR Transfer Status Register
@{*/

/** PIOA_PTSR_TXTEN Transmitter Transfer Enable **/
#define PIOA_PTSR_TXTEN		(1 << 8)
/** PIOA_PTSR_RXTEN Receiver Transfer Enable **/
#define PIOA_PTSR_RXTEN		(1 << 0)

/**@}*/
